gicking/STM8_headers/SVD/STM8AL3L66.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <baseAddress>0x5380</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x002E</size>
        <usage>registers</usage>
      </addressBlock>
      <description>DAC</description>
      <groupName>DAC</groupName>
      <registers>
        <register>
          <name>CR1</name>
          <description>DAC control register 1</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOFF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSEL</name>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>DAC control register 2</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAUDRIE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRIGR</name>
          <description>DAC software trigger register</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>SWTRIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>DAC status register</description>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DMAUDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDHRH</name>
          <description>DAC right aligned data holding register high</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RDHRH</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDHRL</name>
          <description>DAC right aligned data holding register low</description>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RDHRL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LDHRH</name>
          <description>DAC left aligned data holding register high</description>
          <addressOffset>0x000C</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LDHRH</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LDHRL</name>
          <description>DAC left aligned data holding register low</description>
          <addressOffset>0x000D</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>LDHRL</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8</name>
          <description>DAC 8-bit data holding register</description>
          <addressOffset>0x0010</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DHR8</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DORH</name>
          <description>DAC data output register high</description>
          <addressOffset>0x002C</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DORH</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DORL</name>
          <description>DAC data output register low</description>
          <addressOffset>0x002D</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DORL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DM</name>
      <baseAddress>0x7F90</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x000B</size>
        <usage>registers</usage>
      </addressBlock>
      <description>DM</description>
      <groupName>DM</groupName>
      <registers>
        <register>
          <name>BK1RE</name>
          <description>DM breakpoint 1 register extended byte</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK1RH</name>
          <description>DM breakpoint 1 register high byte</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK1RL</name>
          <description>DM breakpoint 1 register low byte</description>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RE</name>
          <description>DM breakpoint 2 register extended byte</description>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RH</name>
          <description>DM breakpoint 2 register high byte</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>BK2RL</name>
          <description>DM breakpoint 2 register low byte</description>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
        <register>
          <name>CR1</name>
          <description>DM Debug module control register 1</description>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>CR2</name>
          <description>DM Debug module control register 2</description>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>CSR1</name>
          <description>DM Debug module control/status register 1</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x10</resetValue>
        </register>
        <register>
          <name>CSR2</name>
          <description>DM Debug module control/status register 2</description>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>ENFCTR</name>
          <description>DM enable function register</description>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0xFF</resetValue>
        </register>
